Repository: LabsDevelopment/Boyfriend
Catalog: locale/Messages.*.resx
Languages: ru, tt_ru

# Ready
source: I'm ready!
ru: Я запустился!
tt_ru: я родился!

# CachedMessageDeleted
source: Deleted message by {0}:
ru: Сообщение {0} удалено:
tt_ru: сообщение {0} вырезано:

# CachedMessageEdited
source: Edited message by {0}:
ru: Сообщение {0} отредактировано:
tt_ru: сообщение {0} переделано:

# DefaultWelcomeMessage
source: {0}, welcome to {1}
ru: {0}, добро пожаловать на сервер {1}
tt_ru: {0}, добро пожаловать на сервер {1}

# Generic1
source: Veemo!
tt_ru: вииимо!

# Generic2
source: Woomy!
tt_ru: вуууми!

# Generic3
source: Ngyes!
tt_ru: нгьес!

source: You were banned
ru: Вы были забанены
tt_ru: вы были забанены

source: Punishment expired
ru: Время наказания истекло
tt_ru: время бана закончиловсь

source: You were kicked
ru: Вы были выгнаны
tt_ru: вы были кикнуты

# Milliseconds
source: ms
ru: мс
tt_ru: мс

# SettingsLanguage
source: Language
ru: Язык
tt_ru: язык

# SettingsRemoveRolesOnMute
source: Remove roles on mute
ru: Удалять роли при муте
tt_ru: удалять звание при муте

# SettingsMuteRole
source: Mute role
ru: Роль мута
tt_ru: звание замученного

source: Language not supported!
ru: Язык не поддерживается!
tt_ru: такого языка нету...

source: Yes
ru: Да
tt_ru: да

source: No
ru: Нет
tt_ru: нъет

# UserNotBanned
source: This user is not banned!
ru: Этот пользователь не забанен!
tt_ru: шизик не забанен

source: Member not muted!
ru: Участник не заглушен!
tt_ru: шизоид не замучен!

# SettingsWelcomeMessage
source: Welcome message
ru: Приветствие
tt_ru: здравствуйте (типо настройка)

# UserBanned
source: {0} was banned
ru: {0} был(-а) забанен(-а)
tt_ru: {0} забанен

# SettingsReceiveStartupMessages
source: Receive startup messages
ru: Получать сообщения о запуске
tt_ru: получать инфу о старте бота

# InvalidSettingValue
source: Invalid setting value specified!
ru: Указано недействительное значение для настройки!
tt_ru: криво настроил прикол, давай по новой

# DurationRequiredForTimeOuts
source: I cannot mute someone for more than 28 days using timeouts! Either specify a duration shorter than 28 days, or set a mute role in settings
ru: Я не могу заглушить кого-то на более чем 28 дней, используя тайм-ауты! Или укажи продолжительность менее 28 дней, или установи роль мута в настройках
tt_ru: ты шо, мутить больше чем на 28 дней таймаут не разрешает, вот настроишь роль мута, тогда поговорим

# CannotTimeOutBot
source: I cannot use time-outs on other bots! Try to set a mute role in settings
ru: Я не могу использовать тайм-ауты на других ботах! Попробуй указать роль мута в настройках
tt_ru: я не могу замутить ботов, сделай что нибудь

# SettingsEventNotificationRole
source: Role for event creation notifications
ru: Роль для уведомлений о создании событий
tt_ru: роль для уведомлений о создании движухи

# SettingsEventNotificationChannel
source: Channel for event notifications
ru: Канал для уведомлений о событиях
tt_ru: канал для уведомлений о движухах

# EventStarted
source: Event "{0}" started
ru: Событие "{0}" началось
tt_ru: движуха "{0}" начинается

# EventCancelled
source: Event "{0}" is cancelled!
ru: Событие "{0}" отменено!
tt_ru: движуха "{0}" отменена!

# EventCompleted
source: Event "{0}" has completed!
ru: Событие "{0}" завершено!
tt_ru: движуха "{0}" завершена!

# MessagesCleared
source: Cleared {0} messages
ru: Очищено {0} сообщений
tt_ru: вырезано {0} забавных сообщений

# SettingsNothingChanged
source: Nothing changed! `{0}` is already set to {1}
ru: Ничего не изменилось! Значение настройки `{0}` уже {1}
tt_ru: ты все сломал! значение прикола `{0}` и так {1}

# MissingUser
source: You need to specify a user!
ru: Надо указать пользователя!
tt_ru: укажи самого шизика

# UserCannotBanMembers
source: You cannot ban users from this guild!
ru: Ты не можешь банить пользователей на этом сервере!
tt_ru: бан

# UserCannotManageMessages
source: You cannot manage messages in this guild!
ru: Ты не можешь управлять сообщениями этого сервера!
tt_ru: тебе нельзя иметь власть над сообщениями шизоидов

# UserCannotKickMembers
source: You cannot kick members from this guild!
ru: Ты не можешь выгонять участников с этого сервера!
tt_ru: кик шизиков нельзя

# UserCannotManageGuild
source: You cannot manage this guild!
ru: Ты не можешь настраивать этот сервер!
tt_ru: тебе нельзя редактировать дурку

# BotCannotBanMembers
source: I cannot ban users from this guild!
ru: Я не могу банить пользователей на этом сервере!
tt_ru: я не могу ваще никого банить чел.

# BotCannotManageMessages
source: I cannot manage messages in this guild!
ru: Я не могу управлять сообщениями этого сервера!
tt_ru: я не могу исправлять орфографический кринж участников, сделай что нибудь.

# BotCannotKickMembers
source: I cannot kick members from this guild!
ru: Я не могу выгонять участников с этого сервера!
tt_ru: я не могу ваще никого кикать чел.

# BotCannotModerateMembers
source: I cannot moderate members in this guild!
ru: Я не могу модерировать участников этого сервера!
tt_ru: я не могу контроллировать за всеми ними, сделай что нибудь.

# BotCannotManageGuild
source: I cannot manage this guild!
ru: Я не могу настраивать этот сервер!
tt_ru: я не могу этому серверу хоть че либо нибудь изменить, сделай что нибудь.

# UserCannotBanBot
source: You cannot ban me!
ru: Ты не можешь меня забанить!
tt_ru: ээбля френдли фаер огонь по своим

# UserCannotBanOwner
source: You cannot ban the owner of this guild!
ru: Ты не можешь забанить владельца этого сервера!
tt_ru: бан админу нельзя

# UserCannotBanTarget
source: You cannot ban this user!
ru: Ты не можешь забанить этого участника!
tt_ru: бан этому шизику нельзя

# UserCannotBanThemselves
source: You cannot ban yourself!
ru: Ты не можешь себя забанить!
tt_ru: самобан нельзя

# BotCannotBanTarget
source: I cannot ban this user!
ru: Я не могу забанить этого пользователя!
tt_ru: я не могу его забанить...

# UserCannotKickOwner
source: You cannot kick the owner of this guild!
ru: Ты не можешь выгнать владельца этого сервера!
tt_ru: кик админу нельзя

# UserCannotKickThemselves
source: You cannot kick yourself!
ru: Ты не можешь себя выгнать!
tt_ru: самокик нельзя

# UserCannotKickBot
source: You cannot kick me!
ru: Ты не можешь меня выгнать!
tt_ru: ээбля френдли фаер огонь по своим

# BotCannotKickTarget
source: I cannot kick this member!
ru: Я не могу выгнать этого участника
tt_ru: я не могу его кикнуть...

# UserCannotKickTarget
source: You cannot kick this member!
ru: Ты не можешь выгнать этого участника!
tt_ru: кик этому шизику нельзя

# UserCannotMuteOwner
source: You cannot mute the owner of this guild!
ru: Ты не можешь заглушить владельца этого сервера!
tt_ru: мут админу нельзя

# UserCannotMuteThemselves
source: You cannot mute yourself!
ru: Ты не можешь себя заглушить!
tt_ru: самомут нельзя

# UserCannotMuteBot
source: You cannot mute me!
ru: Ты не можешь заглушить меня!
tt_ru: ээбля френдли фаер огонь по своим

# BotCannotMuteTarget
source: I cannot mute this member!
ru: Я не могу заглушить этого пользователя!
tt_ru: я не могу его замутить...

# UserCannotMuteTarget
source: You cannot mute this member!
ru: Ты не можешь заглушить этого участника!
tt_ru: мут этому шизику нельзя

# UserCannotUnmuteOwner
source: You don't need to unmute the owner of this guild!
ru: Тебе не надо возвращать из мута владельца этого сервера!
tt_ru: сильно

# UserCannotUnmuteThemselves
source: You are muted!
ru: Ты заглушен!
tt_ru: ты замучен.

# UserCannotUnmuteTarget
source: You cannot unmute this user!
ru: Ты не можешь вернуть из мута этого пользователя!
tt_ru: тебе нельзя раззамучивать

# BotCannotUnmuteTarget
source: I cannot unmute this member!
ru: Я не могу вернуть из мута этого пользователя!
tt_ru: я не могу его раззамутить...

# EventEarlyNotification
source: Event "{0}" will start {1}!
ru: Событие "{0}" начнется {1}!
tt_ru: движуха "{0}" начнется {1}!

# SettingsEventEarlyNotificationOffset
source: Early event start notification offset
ru: Офсет отправки преждевременного уведомления о начале события
tt_ru: заранее пнуть в минутах до начала движухи

# UserNotFound
source: I could not find this user in any guild I'm a member of! Check if the ID is correct and that the user was on this server no longer than 30 days ago
ru: Я не смог найти этого пользователя ни в одном из серверов, в которых я есть. Проверь правильность ID и нахождение пользователя на этом сервере максимум 30 дней назад
tt_ru: у нас такого шизоида нету, проверь, валиден ли ID уважаемого (я забываю о шизоидах если они ливнули минимум месяц назад)

# SettingsDefaultRole
source: Default role
ru: Роль по умолчанию
tt_ru: дефолтное звание

# SettingsPrivateFeedbackChannel
source: Channel for private notifications
ru: Канал для приватных уведомлений
tt_ru: канал для секретных уведомлений

# SettingsPublicFeedbackChannel
source: Channel for public notifications
ru: Канал для публичных уведомлений
tt_ru: канал для не секретных уведомлений

# SettingsReturnRolesOnRejoin
source: Return roles on rejoin
ru: Возвращать роли при перезаходе
tt_ru: вернуть звания при переподключении в дурку

# SettingsAutoStartEvents
source: Automatically start scheduled events
ru: Автоматически начинать события
tt_ru: автоматом стартить движухи

source: Issued by
ru: Ответственный
tt_ru: ответственный

# EventCreatedTitle
source: {0} has created a new event:
ru: {0} создаёт новое событие:
tt_ru: {0} создает новое событие:

# DescriptionLocalEventCreated
source: The event will start at {0} in {1}
ru: Событие пройдёт {0} в канале {1}
tt_ru: движуха произойдет {0} в канале {1}

# DescriptionExternalEventCreated
source: The event will start at {0} until {1} in {2}
ru: Событие пройдёт с {0} до {1} в {2}
tt_ru: движуха будет происходить с {0} до {1} в {2}

# ButtonOpenEventInfo
source: Open Event Info
ru: Открыть сведения о событии
tt_ru: открыть ивент

# EventDuration
source: The event has lasted for `{0}`
ru: Событие длилось `{0}`
tt_ru: все это длилось `{0}`

# DescriptionLocalEventStarted
source: The event is happening at {0}
ru: Событие происходит в {0}
tt_ru: движуха происходит в {0}

# DescriptionExternalEventStarted
source: The event is happening at {0} until {1}
ru: Событие происходит в {0} до {1}
tt_ru: движуха происходит в {0} до {1}

# UserAlreadyBanned
source: This user is already banned!
ru: Этот пользователь уже забанен!
tt_ru: этот шизоид уже лежит в бане

# UserUnbanned
source: {0} was unbanned
ru: {0} был(-а) разбанен(-а)
tt_ru: {0} раззабанен

# UserMuted
source: {0} was muted
ru: {0} был(-а) заглушен(-а)
tt_ru: {0} в муте

# UserUnmuted
source: {0} was unmuted
ru: {0} был(-а) разглушен(-а)
tt_ru: {0} в размуте

# UserNotMuted
source: This member is not muted!
ru: Этот участник не заглушен!
tt_ru: этого шизоида никто не мутил.

# UserNotFoundShort
source: I could not find this user!
ru: Я не смог найти этого пользователя!
tt_ru: у нас такого шизоида нету...

# UserKicked
source: {0} was kicked
ru: {0} был(-а) выгнан(-а)
tt_ru: {0} вышел с посторонней помощью

# DescriptionActionReason
source: Reason: {0}
ru: Причина: {0}
tt_ru: причина: {0}

# DescriptionActionExpiresAt
source: Expires at: {0}
ru: Закончится: {0}
tt_ru: до: {0}

# UserAlreadyMuted
source: This user is already muted!
ru: Этот пользователь уже в муте!
tt_ru: этот шизоид УЖЕ замучился

# MessageFrom
source: From {0}:
ru: От {0}:
tt_ru: от {0}

# AboutTitleDevelopers
source: Developers:
ru: Разработчики:
tt_ru: девелоперы:

# ButtonOpenRepository
source: Octobot's source code
ru: Исходный код Octobot
tt_ru: репа Octobot (тык)

# AboutBot
source: About {0}
ru: О боте {0}
tt_ru: немного об {0}

# AboutDeveloper@mctaylors
source: developer & designer, Octobot's Wiki creator
ru: разработчик и дизайнер, создатель Octobot's Wiki
tt_ru: скучный девелопер + дизайнер создавший Octobot's Wiki

# AboutDeveloper@neroduckale
source: developer
ru: разработчик
tt_ru: ВАЖНЫЙ соучастник кодинг-стримов @Octol1ttle

# AboutDeveloper@Octol1ttle
source: main developer
ru: основной разработчик
tt_ru: САМЫЙ ВАЖНЫЙ чел написавший кода больше всех (99.99%)

# ReminderCreated
source: Reminder for {0} created
ru: Напоминание для {0} создано
tt_ru: напоминалка для {0} скрафченА

# Reminder
source: Reminder for {0}
ru: Напоминание для {0}
tt_ru: напоминалка для {0}

# DescriptionReminder
source: You asked me to remind you {0}
ru: Вы просили напомнить вам {0}
tt_ru: ты хотел чтоб я напомнил тебе {0}

# SettingsListTitle
source: Octobot's Settings
ru: Настройки Octobot
tt_ru: приколы Octobot

source: Setting successfully changed
ru: Настройка успешно изменена
tt_ru: прикол редактирован

source: Setting not changed
ru: Настройка не редактирована
tt_ru: прикол сдох

# SettingIsNow
source: is now
ru: теперь имеет значение
tt_ru: стало

# SettingsRenameHoistedUsers
source: Rename members who attempt to hoist themselves
ru: Переименовывать участников, которые пытаются поднять себя
tt_ru: переобувать шизоидов пытающихся поднять себя в табе

source: Page
ru: Страница
tt_ru: это страница

source: Page not found!
ru: Страница не найдена!
tt_ru: если я был бы html, я бы сказал 404

# PagesAllowed
source: There are {0} total pages
ru: Всего есть {0} страниц(-ы)
tt_ru: ну а если быть точнее, тут всего {0} страниц(-ы)

# ReminderList
source: {0}'s reminders
ru: Напоминания {0}
tt_ru: напоминалки {0}

# InvalidReminderPosition
source: There's no reminder in this position!
ru: У тебя нет напоминания на этой позиции!
tt_ru: у тебя нет напоминалки на этом номере!

source: Reminder deleted
ru: Напоминание удалено
tt_ru: напоминалка уничтожена

# NoRemindersFound
source: You don't have any reminders created!
ru: У вас нет созданных напоминаний!
tt_ru: ты еще не крафтил напоминалки

# SingleSettingReset
source: Setting {0} reset
ru: Настройка {0} сброшена
tt_ru: {0} откачен к заводским

# AllSettingsReset
source: All settings have been reset
ru: Все настройки были сброшены
tt_ru: откатываемся к заводским...

# DescriptionActionJumpToMessage
source: Jump to message: {0}
ru: Перейти к сообщению: {0}
tt_ru: чекнуть сообщение: {0}

# DescriptionActionJumpToChannel
source: Jump to channel: {0}
ru: Перейти к каналу: {0}
tt_ru: чекнуть канал: {0}

# ReminderPosition
source: Position in list: {0}
ru: Позиция в списке: {0}
tt_ru: номер в списке: {0}

# ReminderTime
source: Reminder send time: {0}
ru: Время отправки напоминания: {0}
tt_ru: время отправки: {0}

# ReminderText
source: Reminder text: {0}
ru: Текст напоминания: {0}
tt_ru: че там в напоминалке: {0}

# UserInfoDisplayName
source: Display name
ru: Отображаемое имя
tt_ru: дисплейнейм

# InformationAbout
source: Information about {0}
ru: Информация о {0}
tt_ru: деанон {0}

# UserInfoMuted
source: Muted
ru: Заглушен
tt_ru: замучен

# UserInfoDiscordUserSince
source: Discord user since
ru: Вступил в Discord
tt_ru: юзер Discord со времен

# UserInfoBanned
source: Banned
ru: Забанен
tt_ru: забанен

# UserInfoPunishments
source: Punishments
ru: Наказания
tt_ru: приколы полученные по заслугам

# UserInfoBannedPermanently
source: Banned permanently
ru: Забанен навсегда
tt_ru: пермабан

# UserInfoNotOnGuild
source: Not in the guild
ru: Не на сервере
tt_ru: вышел из сервера

# UserInfoMutedByTimeout
source: Muted by timeout
ru: Заглушен с помощью тайм-аута
tt_ru: замучен таймаутом

# UserInfoMutedByMuteRole
source: Muted by mute role
ru: Заглушен с помощью роли мута
tt_ru: замучен ролькой

# UserInfoGuildMemberSince
source: Guild member since
ru: Вступил на сервер
tt_ru: участник сервера со времен

# UserInfoGuildNickname
source: Nickname
ru: Никнейм
tt_ru: сервернейм

# UserInfoGuildRoles
source: Roles
ru: Роли
tt_ru: рольки

# UserInfoGuildMemberPremiumSince
source: Nitro booster since
ru: Начал бустить сервер
tt_ru: бустит сервер со времен

# RandomTitle
source: Random number for {0} is:
ru: Случайное число для {0}:
tt_ru: рандомное число {0}:

# RandomMinMaxSame
source: Isn't it obvious?
ru: Разве это не очевидно?
tt_ru: ну чувак...

# RandomMax
source: Maximum number: {0}
ru: Максимальное число: {0}
tt_ru: наибольшее: {0}

# RandomMin
source: Minimum number: {0}
ru: Минимальное число: {0}
tt_ru: наименьшее: {0}

source: (default)
ru: (по умолчанию)
tt_ru: (дефолт)

# TimestampTitle
source: Timestamp for {0}:
ru: Временная метка для {0}:
tt_ru: таймштамп для {0}:

# TimestampOffset
source: Offset: {0}
ru: Офсет: {0}
tt_ru: офсет: {0}

# GuildInfoDescription
source: Guild description
ru: Описание сервера
tt_ru: дескрипшон гильдии

# GuildInfoCreatedAt
source: Creation date
ru: Дата создания
tt_ru: создался

# GuildInfoOwner
source: Guild owner
ru: Владелец сервера
tt_ru: админ гильдии

# GuildInfoServerBoost
source: Server Boost
ru: Буст сервера
tt_ru: буст гильдии

# GuildInfoBoostTier
source: Boost level
ru: Уровень буста
tt_ru: уровень

# GuildInfoBoostCount
source: Boost count
ru: Количество бустов
tt_ru: кол-во бустов

# NoMessagesToClear
source: There are no messages matching your filter!
ru: Нет сообщений, которые подходят под твой фильтр!
tt_ru: алло а чё мне удалять-то

# MessagesClearedFiltered
source: Cleared {0} messages from {1}
ru: Очищено {0} сообщений от {1}
tt_ru: вырезано {0} забавных сообщений от {1}

# DataLoadFailedTitle
source: An error occurred during guild data load.
ru: Произошла ошибка при загрузке данных сервера.
tt_ru: произошёл тотальный разнос в гилддате.

# DataLoadFailedDescription
source: This will lead to unexpected behavior. Data will no longer be saved
ru: Это может привести к неожиданному поведению. Данные больше не будут сохраняться.
tt_ru: возможно всё съедет с крыши, но знай, что я больше ничё не сохраню.

# CommandExecutionFailed
source: An error occurred during command execution, try again later.
ru: Произошла ошибка при выполнении команды, повтори попытку позже.
tt_ru: произошёл тотальный разнос в команде, удачи.

# ContactDevelopers
source: Contact the developers if the problem occurs again.
ru: Обратись к разработчикам, если проблема возникнет снова.
tt_ru: если ты это читаешь второй раз за сегодня, пиши разрабам

# ButtonReportIssue
source: Report an issue
ru: Сообщить о проблеме
tt_ru: зарепортить баг

# InvalidTimeSpan
source: Time specified incorrectly!
ru: Неправильно указано время!
tt_ru: ты там правильно напиши таймспан

# UserInfoKicked
source: Kicked
ru: Выгнан
tt_ru: кикнут

source: Reminder edited
ru: Напоминание отредактировано
tt_ru: напоминалка подправлена

# EightBallPositive1
source: It is certain
ru: Бесспорно
tt_ru: абсолютли

# EightBallPositive2
source: It is decidedly so
ru: Предрешено
tt_ru: заявлено

# EightBallPositive3
source: Without a doubt
ru: Никаких сомнений
tt_ru: ваще не сомневайся

# EightBallPositive4
source: Yes — definitely
ru: Определённо да
tt_ru: 100% да

# EightBallPositive5
source: You may rely on it
ru: Можешь быть уверен в этом
tt_ru: будь в этом уверен

# EightBallQuestionable1
source: As I see it, yes
ru: Мне кажется — «да»
tt_ru: я считаю что да

# EightBallQuestionable2
source: Most likely
ru: Вероятнее всего
tt_ru: ну вполне вероятно

# EightBallQuestionable3
source: Outlook good
ru: Хорошие перспективы
tt_ru: ну выглядит нормально

# EightBallQuestionable4
source: Signs point to yes
ru: Знаки говорят — «да»
tt_ru: мне сказали ок

# EightBallQuestionable5
source: Yes
ru: Да
tt_ru: мгм

# EightBallNeutral1
source: Reply hazy, try again
ru: Пока не ясно, попробуй снова
tt_ru: ну-ка попробуй снова

# EightBallNeutral2
source: Ask again later
ru: Спроси позже
tt_ru: давай позже

# EightBallNeutral3
source: Better not tell you now
ru: Лучше не рассказывать
tt_ru: щас пока не скажу

# EightBallNeutral4
source: Cannot predict now
ru: Сейчас нельзя предсказать
tt_ru: я не могу сейчас предсказать

# EightBallNeutral5
source: Concentrate and ask again
ru: Сконцентрируйся и спроси снова
tt_ru: ну сконцентрируйся и давай еще раз

# EightBallNegative1
source: Don’t count on it
ru: Даже не думай
tt_ru: даже не думай

# EightBallNegative2
source: My reply is no
ru: Мой ответ — «нет»
tt_ru: мое завление это нет

# EightBallNegative3
source: My sources say no
ru: По моим данным — «нет»
tt_ru: я тут посчитал, короче нет

# EightBallNegative4
source: Outlook not so good
ru: Перспективы не очень хорошие
tt_ru: выглядит такое себе

# EightBallNegative5
source: Very doubtful
ru: Весьма сомнительно
tt_ru: чот сомневаюсь

# TimeSpanExample
source: Example of a valid input: `1h30m`
ru: Пример правильного ввода: `1ч30м`
tt_ru: правильно пишут так: `1h30m`

# SettingsWelcomeMessagesChannel
source: Welcome messages channel
ru: Канал для приветствий
tt_ru: канал куда говорить здравствуйте

# Version
source: Version: {0}
ru: Версия: {0}
